/*
________________________________________________________________________________
[]                                                                            []
[] This is a part of the PROJECT: 'ObjBase'												[]
[] Copyright (C) 1999 W:Brain                                                 []
[] All rights reserved.                                                       []
[] __________________________________________________________________________ []
[]                                                                            []
[] Name:            ob.cpp																		[]
[] Date:            27.06.99                                                  []
[] Author:          Roman V. Koshelev														[]
[] Description:     Заголовочный файл для проблемного проекта						[]
[]____________________________________________________________________________[]
*/
#define	USES_ALL_H
#define	USES_OC_ALL
#include "Lay_ObjController.h"
#include "../bcc/main.h"


/*______________________________________________________________________________
[]                                                                            []
[]                                                                            []
[] END OF FILE                                                                []
[]                                                                            []
[]____________________________________________________________________________[]
*/
