/*
________________________________________________________________________________
[]                                                                            []
[] This is a part of the PROJECT: 'ObjBase'												[]
[] Copyright (C) 1998 W:Brain Software Inc.                                   []
[] All rights reserved.                                                       []
[] __________________________________________________________________________ []
[]                                                                            []
[] Name:            main.cpp																	[]
[] Date:            01/22/99                                                  []
[] Author:          Roman V. Koshelev														[]
[] Description:     Файл с входной функцией main										[]
[]____________________________________________________________________________[]
*/

#include "ob.h"

DECLARE_SYSTEM_OBJECTS;

//================================================================================================[] 
MM_IS_A_FIRST_OBJECT;											// Обеспечение порядка вызова менеджера памяти
//================================================================================================[] 


//================================================================================================[] 
bool CLEAR_FILE_SYSTEM_BEFORE_START	= false;				// Если true -- очистить файловую систему.
char * FILE_SYSTEM_PATH_AND_NAME		= "files/test";	// Путь к файловой системе и её название.
char * THIS_PROJECT_PREFIX		      = "TEST";	      // Префикс (аббревиатура) текущего проекта.
IMPLEMENT_SYSTEM_OBJECTS;										// Указатели на основные глобальные объекты.
//================================================================================================[] 




//================================================================================================[] 
int main (int argc, char *argv[])
{
	int	nRetVal=0;												// Значение, возвращаемое int main(...)
	CHECK_START_STOP;												// Обработка запроса на запуск/останов базы.
	CREATE_SYSTEM_OBJECTS;										// Создание основных системных объектов
	SERVER_DEBUG_TEXT ("main: приступила к работе.");	// Протоколирование начала работы.

// []--------- Вызови свою головную функцию здесь. ----- []
// []																		[]
	(void) argc; 
	(void) argv;

	RunTest ();

// []																		[]
// []--------- Больше в этом файле ничего не пиши. ----- []

	SERVER_DEBUG_TEXT ("main: закончила работу.");		// Протоколирование окончания работы.
	DELETE_SYSTEM_OBJECTS;										// Удаление основных системных объектов

	return nRetVal;
}
//================================================================================================[] 





/*______________________________________________________________________________
[]                                                                            []
[]                                                                            []
[] END OF FILE                                                                []
[]                                                                            []
[]____________________________________________________________________________[]
*/
