/*
________________________________________________________________________________
[]                                                                            []
[] This is a part of the PROJECT: 'ObjBase'												[]
[] Copyright (C) 1998 W:Brain Software Inc.                                   []
[] All rights reserved.                                                       []
[] __________________________________________________________________________ []
[]                                                                            []
[] Name:            main.cpp																	[]
[] Date:            01/22/99                                                  []
[] Author:          Roman V. Koshelev														[]
[] Description:     Файл с входной функцией main										[]
[]____________________________________________________________________________[]
*/
#define USES_ALL_H
#include "main.h"

//================================================================================================[] 
MM_IS_A_FIRST_OBJECT;											// Обеспечение порядка вызова менеджера памяти
//================================================================================================[] 

//================================================================================================[] 
bool CLEAR_FILE_SYSTEM_BEFORE_START	= true;				// Если true -- очистить файловую систему.
char * FILE_SYSTEM_PATH_AND_NAME		= "files/bcc";	   // Путь к файловой системе и её название.
char * THIS_PROJECT_PREFIX		      = "bcc";	         // Префикс (аббревиатура) текущего проекта.
IMPLEMENT_SYSTEM_OBJECTS;										// Указатели на основные глобальные объекты
//================================================================================================[] 



extern bool b_CREATE_INTERFACE_ONLY;


//______________________________________________________________________________
//                                                                            []
//` Main                                                                      []    
//                                                                            []
int main (int argc, char *argv[])
{
	time_t StartTime = time (0);

   if (argc>1)
   {
      b_CREATE_INTERFACE_ONLY = true;
   }

	int	nRetVal=0;												// Значение, возвращаемое int main(...)
	CREATE_SYSTEM_OBJECTS;										// Создание основных системных объектов
	SERVER_DEBUG_TEXT ("main: приступила к работе.");	// Протоколирование начала работы.


/*----------------------------------------------------------------------------[]
[]																										[]
[]  Проблемный код компилятора базы данных												[]
[]																										*/

	(void) argc; 
	(void) argv;

	theObjDriver.Verify ();
	
/*																										[]
[]																										[]
[]----------------------------------------------------------------------------*/


	SERVER_DEBUG_TEXT ("main: закончила работу.");		// Протоколирование окончания работы.
	DELETE_SYSTEM_OBJECTS;										// Удаление основных системных объектов

	
	time_t EndTime = time (0);
	printf ("\n_____________________________________________________\nDuration: %d sec.\n\nPress any key...", EndTime-StartTime);
	getch  ();
	return nRetVal;
}
//================================================================================================[] 



/*______________________________________________________________________________
[]                                                                            []
[]                                                                            []
[] END OF FILE                                                                []
[]                                                                            []
[]____________________________________________________________________________[]
*/
