/*
________________________________________________________________________________
[]                                                                            []
[] This is a part of the PROJECT: 'ObjBase'												[]
[] Copyright (C) 1999 W:Brain Software Inc.                                   []
[] All rights reserved.                                                       []
[] __________________________________________________________________________ []
[]                                                                            []
[] Name:            STATIC_FILE_ID.h														[]
[] Date:            14.03.99                                                  []
[] Author:          Roman V. Koshelev														[]
[] Description:     Здесь можно зарезервировать константы-идентификаторы		[]
[]						  для файлов определённого назначения, например ini-файл.	[]
[]						  Система изначально создаёт эти файлы и записывает в них 	[]
[]						  один байт 0x00															[]
[]____________________________________________________________________________[]
*/
#ifndef STATIC_FILE_ID_H
#define STATIC_FILE_ID_H


// В этом файле хранится формат базы данных
	#define FILE_ID_LAYOUT			0

// В этом файле хранится идентификатор единственного объекта мастер-класса
	#define FILE_ID_MASTER_CLASS	1

	#define FILE_ID_PROBLEM_FIRST	2
	// От 2 до 100 можно использовать в проблемной области.
	#define FILE_ID_PROBLEM_LAST	100
	
// ...

// Последний зарезервированный иденитификатор
	#define FILE_ID_LAST			1000



#endif
/*______________________________________________________________________________
[]                                                                            []
[]                                                                            []
[] END OF FILE                                                                []
[]                                                                            []
[]____________________________________________________________________________[]
*/