/*
________________________________________________________________________________
[] 																									[]
[] This is a part of the PROJECT: 'BX' 													[]
[] Copyright (C) 1999 TSMC Networks.														[]
[] All rights reserved. 																		[]
[] __________________________________________________________________________ []
[] 																									[]
[] Name: 			  BX_Events.cpp															[]
[] Date: 			  31.07.99																	[]
[] Author:			  Alex Vershinin															[]
[] Description:	  Обработчики событий, приходящих с сайта пользователя.		[]
[] Last Modified:																					[]
[]____________________________________________________________________________[]
*/  

#define USES_BX_Errors
#define USES_BX_Events
#define USES_BX_Utils

#include "BX.h"






/*______________________________________________________________________________
[] 																									[]
[] 																									[]
[]` END OF FILE																					[]
[] 																									[]
[]____________________________________________________________________________[]
*/
