/*______________________________________________________________________________
[]                                                                            []
[] This is a part of the project 'bcc'                                        []
[] Copyright (C) 1999-2000 by the author(s) -- see below.                     []
[] All rights reserved.                                                       []
[] __________________________________________________________________________ []
[]                                                                            []
[] Name:            BX_Main.cpp                                               []
[] Date:            01.04.2000                                                []
[] Author:          Alex Vershinin, Roman V. Koshelev                         []
[] Description:                                                               []
[] Last Modified:                                                             []
[]____________________________________________________________________________*/
#define	USES_BX_SingleObject
#define	USES_ALL_H

#include "BX.h"

DECLARE_SYSTEM_OBJECTS;

//================================================================================================[] 
MM_IS_A_FIRST_OBJECT;											// Обеспечение порядка вызова менеджера памяти
//================================================================================================[] 

//================================================================================================[] 
bool CLEAR_FILE_SYSTEM_BEFORE_START	= false;				// Если true -- очищать файловую систему.
char * FILE_SYSTEM_PATH_AND_NAME		= "files/BX";		// Путь к файловой системе и её название.
char * THIS_PROJECT_PREFIX		      = "BX";	         // Префикс (аббревиатура) текущего проекта.
IMPLEMENT_SYSTEM_OBJECTS;										// Указатели на основные глобальные объекты
//================================================================================================[] 


BX_SingleObject	* pBX_SingleObject = NULL;				// Главный объект Баннерной системы
SET_TIMER_HANDLER (pBX_SingleObject->OnTimer);			// Установка функции-обработчика секундного таймера.


//______________________________________________________________________________
//                                                                            []
//` Main                                                                      []    
//                                                                            []
int main (int argc, char *argv[])
{
	int	nRetVal=0;												// Значение, возвращаемое int main(...)
	
	CHECK_START_STOP;												// Обработка запроса на запуск/останов базы.
	CREATE_SYSTEM_OBJECTS;										// Создание основных системных объектов.
	SERVER_DEBUG_TEXT ("main: приступила к работе.");	// Протоколирование начала работы.

/*----------------------------------------------------------------------------[]
[]																										[]
[]  Проблемный код баннерной системы														[]
[]																										*/
	pBX_SingleObject = new BX_SingleObject;				// Создание главного объекта
	pBX_SingleObject->Create ();								// баннерной системы.

	
#ifndef WIN32
	nRetVal = OBServer_MainLoop (); 							// Вызов основной функции сервера
																		//	для серверной части базы
	SERVER_DEBUG_VALUE(nRetVal);								// Протоколирование результата
#else
	(void)argc; (void)argv;	RunTest ();						// Запустить тест
#endif

	delete	pBX_SingleObject;									// Уничтожение главного объекта
	pBX_SingleObject	= NULL;									// баннерной системы.
/*																										[]
[]																										[]
[]----------------------------------------------------------------------------*/

	SERVER_DEBUG_TEXT ("main: закончила работу.");		// Протоколирование окончания работы.

	puts ("\n\nSHUT DOWN... \n\nWAIT...\n\n");

	DELETE_SYSTEM_OBJECTS;										// Удаление основных системных объектов

	return nRetVal;
}
//================================================================================================[] 




/*______________________________________________________________________________
[]                                                                            []
[]                                                                            []
[] END OF FILE                                                                []
[]                                                                            []
[]____________________________________________________________________________[]
*/

