/*______________________________________________________________________________
[]                                                                            []
[] This is a part of the project 'IT'                                         []
[] Copyright (C) 1999-2000 by the author(s) -- see below.                     []
[] All rights reserved.                                                       []
[] __________________________________________________________________________ []
[]                                                                            []
[] Name:				MOD_UserGroup.inc.h														[]
[] Date:				01.07.2000															      []
[] Author:			Roman V. Koshelev															[]
[] Description:	Работа с группами прав пользователей, 								[]
[]						Описание всего необходимого.											[]
[]____________________________________________________________________________
*/
#ifndef MOD_UserGroup_inc_h
#define MOD_UserGroup_inc_h

//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>[]
// Необходимые данному модулю классы объектов:
	#define USES_OC_User
	#define USES_OC_UserGroup

// Зависимости от других модулей:
	#define USES_MOD_Feod
	#define USES_MOD_User
	#define USES_MOD_UserGroup
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>[]

#include "./../../kernel/config.h"
#include MOD_PATH_INCLUDE_H


#endif
/*______________________________________________________________________________
[]                                                                            []
[]                                                                            []
[] END OF FILE                                                                []
[]                                                                            []
[]____________________________________________________________________________[]
*/