/*______________________________________________________________________________
[]                                                                            []
[] This is a part of the projects 'ZOOB'													[]
[] Copyright (C) 1999-2000 by the author(s) -- see below.                     []
[] All rights reserved.                                                       []
[] __________________________________________________________________________ []
[]                                                                            []
[] Name:          config.h																		[]
[] Date:          19.oct.2000																	[]
[] Author:        Roman V. Koshelev															[]
[] Description:   Стандартные настройки для различных приложений ZOOB			[]
[]____________________________________________________________________________[]
*/
                                                             
#ifndef KERNEL_CONFIG_H
#define KERNEL_CONFIG_H




/*______________________________________________________________________________
[]                                                                            []
[]  MOD_PATH_INCLUDE_H                                                        []
[]                                                                            []
[]` Путь от модулей до файла, содержащего указания на то, какие файлы надо 	[]
[]  включать в проект приложения.															[]
[]____________________________________________________________________________[]
*/
#ifdef		APPLICATION_INTERTEK
	#define	MOD_PATH_INCLUDE_H		"./../../applications/intertek/include.h"
#endif
//____________________________________________________________________________[]







/*______________________________________________________________________________
[]                                                                            []
[]                                                                            []
[]` SERVER                                                                    []      
[]                                                                            []
[]____________________________________________________________________________[]
*/
// Использование хелпера
#define	HELPER_DISABLED

// Размер буфера для передачи аргументов между проблемной и серверной частями.
#define	OUT_STREAM_BUFFER_SIZE	(1024*1024)

// Размер буфера для значения аргумента проблемной функции.
#define	MAX_ARG_VALUE_LENGTH		(1024*256)

// Размер буфера для имени аргумента проблемной функции.
#define	MAX_ARG_NAME_LENGTH		64

// Маркер начала значения аргумента.
#define	FIELD_HEADER_STR			"\x1"
#define	FIELD_HEADER_CHAR			1

// Маркер начала имени аргумента.
#define	ARG_NAME_HEADER_STR		"\x2"
#define	ARG_NAME_HEADER_CHAR		2

// Разделитель функциональной/входной/выходной частей запроса.
#define	QUERYBLOCK_SEP_STR		"\x3"
#define	QUERYBLOCK_SEP_CHAR		3

// Параметры работы с сокетами:
#define	OBS_LISTEN_PORT			1502				// Порт, прослушиваемый сервером.
#define	OBS_ACCEPT_TIMEOUT		0					// Таймаут на ожидание появления соединений в очереди в микросекундах.
#define	OBS_READ_TIMEOUT			500000			// Таймаут на ожидание готовности клиента послать запрос в микросекундах.
#define	OBS_WRITE_TIMEOUT			500000			// Таймаут на ожидание готовности клиента принять ответ в микросекундах.
#define	OBS_MAX_BACKLOG_NUM		128				// Размер сокетной очереди.
																
// Параметры функционирования сервера:				
#define	OBS_SLEEP_TIME					10000			// Продолжительность сна при отсутствии запросов в микросекундах.
#define	OBS_TIMER_INTERVAL			1				// Минимальное время в секундах, через которое вызывается обработчик OBServer_OnTimer().
#define	OBS_MAX_DATABLOCK_SIZE		(1024*1024)	// Максимальный размер блока данных, принимаемый сервером.
#define	OBS_HISTORY_SIZE				100			// Размер статистики по производительности.

// Имя файла лога времени выполнения OBServer_Interface().
#define	TimelogFileName				"./logs/time_log.html"	

// Имя файла с логом протокола работы ZOOB-сервера.
#define	DB_LOG_HTML						"./logs/db_log.html"

// Имя lock-файла сервера.
#define	LockFileName					"./ZOOB.PID"													

// Дескриптор лога ошибок протокола сервера.
#define	OBS_ERROR_LOG					stderr
//____________________________________________________________________________[]







/*______________________________________________________________________________
[]                                                                            []
[]                                                                            []
[]` Специфичные для приложений настройки                                      []
[]                                                                            []
[]____________________________________________________________________________[]
*/
#ifdef APPLICATION_BX
	#include "./../applications/BX/config.h"
#endif
//____________________________________________________________________________[]













#endif
/*______________________________________________________________________________
[]                                                                            []
[]                                                                            []
[] END OF FILE                                                                []
[]                                                                            []
[]____________________________________________________________________________[]
*/
