Понятия|Concept						{Concept}









	Описание сайта 					{Concept.Site}
		Тематики 						{Concept.Site.Topic}
			Бизнес, экономика, финансы
				Торговля
				Финансы
				Банки
				Транспорт
				Компании
				Малый бизнес
				Маркетинг
				Аналитика
				Строительство и недвижимость 
				Промышленность
				Бизнес-сервис
				Международная экономика
				Рекламный бизнес
				Электронная коммерция
				Инвестиции
				Издательское дело
				Связь и телекоммуникации
				Агропромышленный комплекс
				Топливно-энергетический комплекс
				Коммерческая информация
				Показатели экономики
				Справочная информация
				Бытовые услуги
				Потребительская экономика
				Семинары
				Школы бизнеса
				Официальные и общественные организации
				Страховые компании
				Внешнеэкономическая деятельность
				Военно-промышленный комплекс
				Коммерческие фирмы широкого профиля
				Коммунальное хозяйство
			Интернет, компьютеры
				Поиск в Интернет
				Web-каталоги
				Рейтинги
				Счётчики
				Баннерные сети
				Программное обеспечение
					Каталоги
					Обозрения
				Интернет-кафе, клубы
				Компьютерный рынок
				Веб-дизайн, графика
				Провайдеры
				Размещение сайтов (хостинг)
				Электронная коммерция
				Издания, аналитика, публикации
				Средства информационной безопасности 
				Компьютерные сети 
				Новости
				Мультимедиа
				Представительства СМИ 
				Internet-обозрения
				Выставки, семинары, форумы 
			Товары, услуги
				Услуги связи
				Каталоги товаров
				Online-магазины
				Аукционы
				Информация для потребителей
				Прайс-листы, цены
				Чёрные списки
				Сайты организаций
			Общение
				Чаты
				Гостевые книги
				Форумы
				Серверы знакомств
				Фото-галереи
				Виртуальные открытки
			Культура, искусство							{Concept.Site.Topic.Music}
				Музыка 
					Коллекции музыкальных файлов
					Исполнители, композиторы
					Обозрения
					Музыкальная литература
					Музыкальные произведения
					Направления в музыке					{Concept.Site.Topic.Music.Styles}
						Амбиент
						Блюграсс
						Блюз
						Кельтика
						Классический рок
						Классика
						Кантри
						Диско
						Электроника
						Фолк
						Фанк
						Фьюжн
						Госпел
						Готика
						Индастриал
						Инструментальная музыка
						Джаз
						Лоундж
						Металл
						Новое поколение
						Новая волна
						Панк
						Рэп
						Рок - поп
						Рокабилли
						Для души
						Прочее
				Литература 									{Concept.Site.Topic}
					Классическая
					Современная
					Старинная
					Зарубежная
					Русская
					Детская
					Афоризмы, изречения
					Детектив, приключения
					Мемуары, публицистика, философия, наука
					Мифы, фольклор
					Поэзия
					Фантастика, фэнтези
					Издательства, реализация книг
					Либретто, пьесы
					Юмор
					Страницы книголюбов
					Страницы литераторов
					Музыкальная литература
				Электронные библиотеки
				Клубы, объединения, ассоциации
				Литературные издания
				Библиотеки 
				Изобразительное искусство	
				Кино 
				Фотоискусство
				Музеи, галереи, выставки
				Архитектура 
				Театр 
				Дизайн
				Культура и искусство. Регионы 
				Декоративно-прикладное искусство 
				Танец, хореография
				Мода
				Справочная информация 
				Официальные и общественные организации 
				История искусств
				Публикации
				Цирк 
				Регионы
				Этика
			Авто, мото, транспорт
				Сайты, посвящённые автомобилям
				История автомобилестроения
				Купля/продажа/обмен
				Представительства организаций
				Увлечения
			Работа
				Работа за рубежом
				Агенства трудоустройства
				Базы данных
			Образование
				Высшее образование 
				Среднее образование, детские организации 
				Дистанционное образование 
				Дополнительное образование 
				Периодика по проблемам образования
			Медицина, здоровье
				Медицинская наука и образование 
				Лечение, диагностика, консультации. Услуги 
				Фармацевтика и медицинские товары 
				Медицинское оборудование и технологии 
				Больницы и медицинские центры
				Справочная информация 
				Официальные и общественные организации 
				Болезни
				Профилактика и оздоровление 
				Виртуальная медицина 
				Ветеринария 
				Медицинское страхование 
				Нетрадиционная медицина
				Издания и публикации
				Медицинское обслуживание
			Наука, техника
				Общественные и гуманитарные науки
				Естественные науки и математика 
				Медицинская наука
				Технические науки 
				Альтернативные науки 
				Новые технологии
				Научные учреждения 
				Научные конференции, симпозиумы, семинары 
				Органы научно-технической информации 
				Стипендии, гранты, международные программы 
				Официальные организации 
				Справочная информация 
			Религия, мистика, гороскопы
				Христианство
				Церковь
				Православие
				Магия, колдовство
				Гороскопы
				НЛО
			Общество, государство, политика
				Право и законодательство 
				Партии и общественные организации 
				Религия 
				Общество и политика. Регионы 
				Международные отношения 
				Региональные власти 
				Выборы 
				Новости и информационные агентства 
				Армия и вооружение 
				Федеральная власть 
				Правозащитная деятельность 
				Неправительственные организации
				Службы спасения
				Благотворительные сайты
				Исполнительная власть
				Судебная власть 
				Справочная информация 
				Преступность
				Общественные организации, объединения, компании
			Юмор, игры, отдых, развлечения, хобби
				Анекдоты
				Игровые сайты
				Коллекци приколов
				Забавные картинки
				Кафе, бары, клубы, дискотеки, рестораны
				Праздники, мероприятия
			Семья, дом, досуг, природа
				Быт и финансы 
				Отдых 
				Покупки 
				Автомобили 
				Игры
				Личная жизнь 
				Юмор
				Хобби
				Питание 
				Животный мир 
				Стиль жизни 
				Уют и комфорт
				Дети 
				Женщины
			Средства Массовой Информации
				Деловые и отраслевые издания 
				Регионы 
				Телевидение 
				Виртуальные СМИ 
				Общественно-политические издания 
				Радио 
				Компьютерные издания
				Internet-обозрения
				Научные издания 
				Домашнее чтение и досуг 
				Зарубежные издания 
				Литературные издания 
				Журналистика
				Новости и обозрения
				Спортивные издания 
				Периодические издания
				Услуги для СМИ
				Издания о культуре и искусстве 
				Официальные и общественные организации 
				Научно-популярные издания 
				Издательства периодических изданий 
				Автомобильные издания 
				Религиозные издания 
				Услуги для СМИ 
				Справочная информация 
				Периодика по проблемам образования 
				Информационные агентства 
			Спорт, активный отдых
				Виды спорта 
				Игры cпортивные  
				Футбол 
				Автоспорт 
				Хоккей 
				Охота и рыболовство
				Официальные и общественные организации 
				Оздоровительные и спортивные услуги 
				Спорт. Регионы 
				СМИ спортивные  
				Соревнования, турниры
				Олимпийские игры
				Команды
				Спортсмены
				Шахматы и шашки 
				Спортивные товары
				Детский и юношеский спорт 
				Товары спортивные  
				Парашютный и планерный спорт
				Справочная информация 
				Спортивное образование
				Спорт для инвалидов 
			Путешествия, туризм
				Туристические агенства
				Гостиницы, санатории, пансионаты
				Курорты, места отдыха
				Водный туризм
				Горный туризм
				Спелеология
				Турклубы
				КСП
			Справочники, каталоги, ссылки
				Адреса и номера телефонов
				Справочная деловая информация 
				Справочники 
				Афиши
				Товары, услуги и цены 
				Почтовая информация
				Календари дат и событий
				Культура и искусство 
				Погода 
				Карты
				Флаги
				Расписания
				Словари
				Стандарты
			Страны, регионы, города
				Россия. Регионы 
					Москва
					Ленинград
				Европа 
				Азия 
				Фотоматериалы 
				Америка 
				Россия - взгляд из-за рубежа 
				Африка 
				Австралия и Новая Зеландия 
				Интересные места
				Посольства, консульства, визы
				Путешествия, туризм
				Туристические издания
			Для взрослых
			Разное
		Тип ресурса 										{Concept.Site.Type}
			Информационный тематический ресурс
			Корпоративный сайт (web-проедставительство)
			Некоммерческий проект
			Online-сервис
			Личная страница
		Дизайн сайта										{Concept.Site.Design}
			Строгий, академический
			Многоцветный
			Чёрный фон
			Светлый фон
			Много графики
			Используются фреймы
			Интерактивный
			Текстовый дизайн
			Использует Java-scripts
			Построен на Dynamic-HTML
			Используется Java
			Используется Flash












	Описание зрителя, сети				{Concept.Viewer}
		Возраст								{Concept.Viewer.Age}
			Старше 45
			от 35 до 45 лет
			от 25 до 34 лет
			от 20 до 24 лет
			от 16 до 19 лет
			От 7 до 16 лет
			До 7 лет
			Не скажу
		Пол									{Concept.Viewer.Sex}
			Мужской
			Женский
		Область деятельности 			{Concept.Viewer.Profession}
			Промышленность
			Банковская деятельность, финансы
			Компьютеры, интернет
			Наука
			СМИ и реклама
			Торговля
			Образование
			Органы власти
			Здравоохранение
			Армия, МВД
			Сфера обслуживания
			Строительство
			Транспорт
			Связь
			Культура и искусство
			Сельское хозяйство
			Надомная работа
			Другая область деятельности
			Не скажу
		Cтатус занятости					{Concept.Viewer.SocStatus}
			Квалифицированный специалист
			Студент, учащийся
			Технический и обслуживающий персонал
			Руководитель высшего звена
			Руководитель среднего звена
			Служащий
			Рабочий
			Временно не работаю
			Домохозяйка
			Другой
			Не скажу
		Владение 							{Concept.Viewer.Ownership}
			Перс.компьютер дома
			Доступ в Интернет из дома
			Сотовый телефон
			Пейджер
			Музыкальный центр
			Автомобиль
			Бизнес
			Дом, квартира
			Видеокамера
			Видеомагнитофон
			Кредитная карта
		Отношение к Интернет-рекламе	{Concept.Viewer.AdvertAttitude}
			Я иногда покупаю рекламируемые товары
			Реклама не влияет на мое решение о покупке
			Я не верю рекламе
			Реклама помогает мне узнать о новых товарах и услугах
		Какие баннеры Вам нравятся:	{Concept.Viewer.AdvertPreferences}
			Красивые
			Смешные
			Содержательные
			Простенькие
			Аниммированные
			Неанимированные
			С эротикой
			С фотографиями
			Рисованные
			Основанные на Flash-технологии
			Текстовые
			Никакие
		Онлайн-услуги						{Concept.Viewer.OnlineServices}
			Заказ билетов
			Покупка товаров
			Покупка программного обеспечения
			Бронирование гостинниц
			Прочее
			Не пользовался
		Доступ к Internet 				{Concept.Viewer.InternetAccess}
			Из дома
			С работы
			Из учебного заведения
			У знакомых
			Интернет-кафе
			Мобильная связь
			Не скажу
		Характер информации, получаемой через Интернет {Concept.Viewer.InternetGoal}
			Новое прогр обеспечение
			Документация
			Компьютерные игры
			Музыка, видео, шоу-бизнес
			Развлечения
			Товары и услуги
			Фин и экон новости
			Техника
			Политика
			Электр коммерция
			Погода
			Эротика
			On-line пресса
			Спорт
			Искусство
			Популярная наука
			Путешествия
			Медицина
		Стаж работы в Интернете 		{Concept.Viewer.InternetTime}
			до 3 месяцев 
			3 месяца - 1 год
			1 год - 2 года 
			более 2 лет
		Частота пользования Интернетом {Concept.Viewer.InternetFreq}
			Каждый день
			2-3 раза в неделю
			Один раз в неделю
			2-3 раза в месяц
			Один раз вмесяц
			Реже 1 раза в месяц
		Уровень доходов						{Concept.Viewer.Circumstance}
			Более 2,000$ в месяц
			От 1,000$ до 2,000$ в месяц
			От 600$ до 1,000$ в месяц
			От 300$ до 600$ в месяц
			От 100$ до 300$ в месяц
			Менее 100$ в месяц
			Не скажу
		Семейное положение					{Concept.Viewer.FamilyStatus}
			Молодая семья с детьми
			Молодая семья
			Женат/замужем, детей нет
			Женат/замужем, есть дети
			Холост/не замужем, детей нет
			Холост/не замужем, есть дети
			Не скажу
		Образование 							{Concept.Viewer.Education}
			Высшее
			Незаконченное высшее
			Среднее
			Неполное среднее (начальное)
			Не скажу
		Состояние здоровья					{Concept.Viewer.Health}
			Отменное
			Нормальное
			Пошаливает
			Плохое
			Не скажу
		Знак зодиака							{Concept.Viewer.Zodiac}
			Водолей
			Рыбы
			Овен
			Телец
			Близнецы
			Рак
			Лев
			Дева
			Весы
			Скорпион
			Стрелец
			Козерог
			Не знаю
		Стиль жизни, увлечения				{Concept.Viewer.LifeStyle}
			Туризм, путешествия, прогулки
			Спорт, активные игры
			Домашние животные, аквариумы
			Фотография
			Театр, кино
			Музыка
			Литература
			Клубы, дискотеки, бары, рестораны
			Коллекционирование
			Радио, электроника
			Компьютеры
			Интернет
			Общение
			Компьютерные игры
			Настольные игры
			Домашнее хозяйство
			Моделирование
			Курение
			Shopping
			Работа
			Другое
			Не скажу

		Отношение к политике				{Viewer.Concept.Politic}
			Консервативное движение России
			Российский общенародный союз
			Женщины России
			Сталинский блок - за СССР
			Объединение "ЯБЛОКО"
			Коммунисты, трудящиеся России - за Советский Союз
			Мир. Труд. Май
			Блок генерала А.Николаева, академика С.Федорова
			ВОПД "Духовное наследие
			Конгресс Русских Общин и Движение Юрия Болдырева
			Партия Мира и Единства
			Российская партия защиты женщин
			Межрегиональное движение "Единство"("МЕДВЕДЬ")
			Социал-демократы
			Общероссийское политическое движение "В поддержку армии"
			БЛОК ЖИРИНОВСКОГО
			За гражданское достоинство
			ОТЕЧЕСТВО - ВСЯ  РОССИЯ
			Коммунистическая партия Российской Федерации
			Русское Дело
			Всероссийская политическая партия народа
			Союз Правых Сил
			ВОПД ""Наш дом - Россия
			Социалистическая партия России
			Партия пенсионеров
			Русская социалистическая партия
			Не интересуюсь политикой
		Рост										{Viewer.Concept.Height}
			Выше 200 см.
			190-200 см.
			180-190 см.
			170-180 см.
			160-170 см.
			150-160 см.
			150-160 см.
			Ниже 150 см.
			Не скажу
		Вес										{Concept.Viewer.Weight}
			Более 150 кг.
			120-150 кг.
			100-120 кг.
			90-100 кг.
			80-90 кг.
			70-80 кг.
			60-70 кг.
			50-60 кг.
			40-50 кг.
			Менее 40 кг.
			Не скажу
		Цвет волос								{Concept.Viewer.Hair}
			Светлые
			Тёмные
			Рыжие
			Нет волос
			Не скажу
		Цвет глаз								{Concept.Viewer.Eyes}
			Зелёные
			Голубые
			Серые
			Карие
			Не скажу
		Регионы									{Concept.Viewer.Region}
			География							{Concept.Viewer.Region.Geo}
				Россия							{Concept.Viewer.Region.Geo.Main}
					Москва
					Санкт-Петербург
					Казань
					Челябинск
					Новосибирск
					Екатеринбург
					Самара
					Калининград
					Нижний Новгород
					Красноярск
					Краснодар
					Центральная Россия
					Западная Сибирь
					Юг России. Северный Кавказ
					Урал
					Поволжье
					Дальний Восток
					Волго-Вятский район
					Восточная Сибирь
					Север России
					Северо-Запад России
				Ближнее зарубежье
					Украина
						Киев
					Белоруссия
						Минск
					Молдова
					Прибалтика
					Туркмения
					Грузия
					Армения
				Израиль
				США
				Канада
				Европа							{Concept.Viewer.Region.Geo.Other}
					Восточная Европа
						Польша
						Венгрия
						Болгария
						Чехия
						Словакия
						Румыния
					Западная Европа
						Англия
						Франция
						Германия
						Испания
						Италия
						Греция
				Азия
					Индия
					Пакистан
					Иран
					Ирак
					Китай
					Корея
					Япония
				Австралия
				Центральная и Южная Америка
					Мексика
					Куба
					Колумбия
					Бразилия
					Аргентина
				Африка
				Антарктида
				Локальная сеть
					Bibirevo Net
						11-й сегмент БибиревоНет.
						12-й сегмент БибиревоНет.
						23-й сегмент БибиревоНет.
						32-й сегмент БибиревоНет.
						33-й сегмент БибиревоНет.
						42-й сегмент БибиревоНет.
						62-й сегмент БибиревоНет.
					NorthNet
						200-й сегмент NorthNet.
						61-й сегмент NorthNet.
			Cеть									{Concept.Viewer.Region.IPNetwork}
				Банки и финансовые организации
				Правительственные структуры
				Учебные заведения
				Информационные структуры
				Компьютерные фирмы
				Провайдеры/DialUp
					ZENON (AHA)
					CityLine
					AOL
					MTU-Inform
				Коммерческие структуры
				Нефте-газовые компании
				Металлургия
				Домашние сети
				Прочие
		Операционная система 				{Concept.Viewer.OS}
		Броузер									{Concept.Viewer.Browser}
		Charset									{Concept.Viewer.Charset}
		Язык										{Concept.Viewer.Language}
		Разрешение экрана 					{Concept.Viewer.ScreenSize}
		Глубина цвета							{Concept.Viewer.Colors}
		Версия ява-скрипта					{Concept.Viewer.JavaScriptVersion}
		Java										{Concept.Viewer.Java}











			

	Описание баннера									{Concept.Banner}
		Внешний вид баннера							{Concept.Banner.Appearance}
			Анимированный
			Цветной
			Одноцветный
			Простое изображение
			Сложное изображение
			Яркий
			Незаметный
			Рисованный
			Фотоколлаж
			Смешной, с юмором
			Серьёзный
			"Жми сюда" ("click here")
			С элементами интерфейса
			С текстовой информацией
			С адресом URL
			С элементами эротики
			Непристойный
		Геометрия баннера 							{Concept.Banner.Shape}
			468x60 - Самый распространённый формат
			234x60 - Половинка
			120x60 - Заглушка
			100x100 - Квадратный баннер
			125x125 - Большой квадратный баннер
			126x126 - Неправильный квадратный баннер
			200x55 - Ухо
			150x80 - Большое ухо
			230x33 - Мелкий баннер
			81x63 - Счетчик
			88x31 - Баннерик
			175x44 - Кнопка
			470x60 - Новинка от Лебедева
			400x40 - Планка
			640x480 - Чтобы мало не казалось
		Физический тип баннера						{Concept.Banner.Format}
			GIF -- image/gif
			JPEG -- image/jpeg
			HTML -- text/html
			TEXT -- text/plain
			WAV -- audio/wav
			MIDI -- audio/mid
			MP3 -- audio/mpeg












	Товары и услуги						{Concept.Goods&Services}
		Товары								{Concept.Goods&Services.Goods}
			Компьютеры
				Cерверы
				Портативные компьютеры (notebooks)
				Настольные компьютеры
					Компьютеры IBM-совместимые
					Компьютеры Apple Macintosh
					Другие настольные компьютеры
				PDA
				Рабочие станции
				Игровые приставки
				Промышленные компьютеры и АСУ
				Мейнфреймы
			Компьютерное оборудование
				Комплектующие
					Процессоры
					Память
					Графические карты, видеокарты
					Звуковые карты и мультимедиа-наборы
					Корпуса и блоки питания
					Платы ввода-вывода
					Cистемные платы (motherboard)
				Мониторы
				LCD-панели
				Накопители HDD, CD-ROM, DVD
				Принтеры
				Cканеры
				Клавиатура
				Мыши
				Джойстики
				Графические планшеты и дигитайзеры
				Миди-клавиатуры
				Cетевое оборудование
				Модемы, факс-модемы
				Носители информации (дискеты, магнито-оптика, ...)
				UPS, фильтры, стабилизаторы
				Компьютерные аксессуары
			Оргтехника, офисное оборудование
			Аудио-Видео
				Hi-End
				Авто-техника
				Аудиоплееры
				Видеокамеры
				Видеомагнитофоны, видеоплееры
				Музыкальные центры
				Телевизоры
				Электромуз.инструменты
			Бытовая техника
				Крупная быт.техника
				Мелкая быт.техника
				Хозяйственные товары
			Галантерея
			Детские товары
			Животный мир
			Лекарства
			Мебель
				Домашняя
				Офисная
			Недвижимость
				Гаражи
				Дачи
				Земля
				Квартиры, комнаты
				Жилые здания
				Складские помещения
				Производственные помещения
				Оффисные помещения
				Коттеджи
			Оборудование/стройматериалы
			Системы вентиляции и кондиционирования
			Средства связи
				Сотовые телефоны
				Пейджеры
				Офисные АТС
				Телефоны
				Факсы
				Аксессуары для средств связи
			Оборудование для издательств и типографий
			Оборудование для презентаций
			Оборудование для издательств и типографий 
			Банковское оборудование
			Оборудование для торговых предприятий
			Геодезическое оборудование
			Парфюмерия и косметика
				Декоративная косметика
				Средства ухода за кожей
			Продукты питания
			Напитки
				Алкогольные
				Безалкогольные
			Табачные изделия
			Одежда и обувь
				Детская
				Женская
				Мужская
				Спортивная
			Товары для спорта и отдыха
			Автомобили
				Комиссионные
				Новые
				Иномарки
				Отечественные
			Велосипеды
			Фототовары
				Цифровые камеры
				Плёночные камеры
				Расходные материалы
				Аксессуары
		Программное обеспечение 											{Concept.Goods&Services.Soft}
			Компьютерные игры
			Cистемные продукты и утилиты
			Коммуникационные и сетевые программы
			Интегрированные пакеты
			Бухгалтерские и финансовые программы
			Информационные системы
			Программы для банков
			Программы для организации коммерческой деятельности
			Программы для издательства
			Графические и мультимедиа программы
			Языки и инструменты программирования
			Обучающие программы
			СУБД
			Библиотеки изображений
			Разработка программ под заказ
			САПР
			Видеокомпакт-диски (video CD)
			Cистемы защиты
			Энциклопедические программы
			Текстовые процессоры
			Электронные таблицы
			Организаторы работы
			Программы проверки правописания (spellchecker) и анализа текста
			Программы-словари и системы перевода
			Программы распознавания символов (OCR) и речи
			Программы для создания и поддержки web-серверов
		Услуги																{Concept.Goods&Services.Services}
			Туризм и путешествия
			Кафе, бары, клубы, рестораны, дискотеки, ...
			Театр, кино
			Трудоустройство, кадровые агенства
				В России
				За рубежом
			Услуги в Internet
				Провайдерские услуги
				Разработка и дизайн сайтов
			Служба знакомств
			Эротические услуги
			Спортивные залы
			Отдых, развлечения
			Обучение
			Ремонт техники
			Медицинские услуги
			Перевод текстов
			Транспортные услуги
			Юридические консультации
			Системная интеграция
			Компьютеры
				Услуги по установке сетей 
				Ремонт, сервис, модернизация компьютеров
				Обучение работе на компьютерах, авторизованное тестирование
			Транспортные услуги и услуги автосервиса
		Ценовая категория 												{Concept.Goods&Services.Price}
			Cвыше 10,000$
			От 1000$ до 10,000$
			От 100$ до 1000$
			От 50$ до 100$
			От 25$ до 50$
			От 10$ до 25$
			От 1$ до 10$
			Менее 1$
